routes/web.php

select * from [evaluacions] where [user_id] = 1
---
    return redirect(route('dashboard'));
});

Route::middleware(['auth:sanctum', 'verified'])->get('/dashboard', function () {
    $currentDate = date('Y-m-d');
    $evaluacionesdehoy = 0;
    $evaluacions = Evaluacion::where('user_id', Auth::user()->id)->get();
    foreach ($evaluacions as $evaluacion){
        $fechaupdated = date('Y-m-d', strtotime($evaluacion->updated_at));
        if($fechaupdated == $currentDate){
            $evaluacionesdehoy = $evaluacionesdehoy + 1;
        }
    }

    return view('dashboard', compact('evaluacions', 'evaluacionesdehoy'));
})->name('dashboard');