app/Http/Livewire/Calidad.php

select top 1 * from [periodos] where [periodo_id] = '2104'
select * from [periodos]
select * from [estados]
select * from [users] where [perfil] = 2
---
    public function mount(){
        $this->filtroPeriodo = Periodo::where('periodo_id',now()->format('ym'))->first()->id;
        $this->periodos = Periodo::all();
        $this->estados = Estado::all();
        $this->usuarios = User::where('perfil', 2)->get();

select * from [evaluacions] where [user_id] = 4 and [asignacion_id] >= 27 and [asignacion_id] <= 35 and [ici] is not null
---
    public function promedioici($usuario_id){
        $evaluaciones = Evaluacion::where('user_id',$usuario_id)->where('asignacion_id','>=',$this->asignacion1)->where('asignacion_id','<=',$this->asignacion2)->whereNotNull('ici')->get()->avg('ici');

select * from [evaluacions] where [user_id] = 4 and [asignacion_id] >= 27 and [asignacion_id] <= 35 and [ici] is not null
---
    public function cuentaici($usuario_id){
        $evaluaciones = Evaluacion::where('user_id',$usuario_id)->where('asignacion_id','>=',$this->asignacion1)->where('asignacion_id','<=',$this->asignacion2)->whereNotNull('ici')->get();

select * from [asignacions] where [periodo_id] = 3 order by [id] asc
select * from [evaluacions] where [estado_id] >= 2 and [estado_id] <= 5 and [asignacion_id] >= 27 and [asignacion_id] <= 35
---
    public function render()
    {
        //$asignaciones = Asignacion::where('periodo_id',$this->filtroPeriodo)->get()->toArray();
        //$this->asignacion1 = $asignaciones[array_key_first($asignaciones)]['id'];
        //$this->asignacion2 = $asignaciones[array_key_last($asignaciones)]['id'];

        $asignaciones = Asignacion::where('periodo_id',$this->filtroPeriodo)->orderBy('id')->get();
        $this->asignacion1 = $asignaciones->first()->id;
        $this->asignacion2 = $asignaciones->last()->id;

        $evaluaciones = Evaluacion::where('estado_id','>=',2)->where('estado_id','<=',5)->where('asignacion_id','>=',$this->asignacion1)->where('asignacion_id','<=',$this->asignacion2);

        if($this->filtroEstado){
            $evaluaciones->where('estado_id',$this->filtroEstado);
        }

        if($this->filtroUsuario){
            $evaluaciones->where('user_id',$this->filtroUsuario);
        }

        return view('livewire.calidad', [
            'evaluaciones' => $evaluaciones->paginate(40),
        ]);