app/Http/Livewire/PautaDigital.php

    public function mount($evaluacionid){
        $this->evaluacionid = $evaluacionid;
        $evaluacion = Evaluacion::where('id',$this->evaluacionid)->first();

        if($evaluacion->fecha_ici){
            $this->marca_ici = 1;
        }
        $this->respuestas = Respuesta::where('evaluacion_id',$evaluacionid)->get();
        $this->gestiones = Escala::where('grupo_id',1)->get();
        $this->resoluciones = Escala::where('grupo_id',2)->get();
---
select top 1 * from [evaluacions] where [id] = 24234
select * from [respuestas] where [evaluacion_id] = 24234
select * from [escalas] where [grupo_id] = 1
select * from [escalas] where [grupo_id] = 2

    public function ici()
    {
        if(array_count_values($this->rules2)>1 and array_count_values($this->rules3)>1){
            $this->validate(array_merge($this->rules1, $this->rules2, $this->rules3));
        }elseif(array_count_values($this->rules2)>1){
            $this->validate( array_merge($this->rules1, $this->rules2));
        }else{
            $this->validate($this->rules1);
        }

        $suma = 0;
        $respuestas = Respuesta::where('evaluacion_id', $this->evaluacionid)->get();
---
select * from [respuestas] where [evaluacion_id] = 24234

            $respuesta->origen_id = 2;
            $respuesta->save();
        }
        $evaluacion = Evaluacion::where('id',$this->evaluacionid)->first();
        $evaluacion->ici = $suma / 92;
        $evaluacion->user_ici = Auth::user()->id;
        $evaluacion->fecha_ici = now()->format('d-m-Y H:i:s');
        $evaluacion->save();
---
select top 1 * from [evaluacions] where [id] = 24234
update [evaluacions] set [ici] = 1.0869565217391, [fecha_ici] = '16-04-2021 15:36:07', [user_ici] = 1, [evaluacions].[updated_at] = '16-04-2021 15:36:07' where [id] = '24234'

    public function guardarespuesta($atributoid, string $atributotext){

        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', $atributoid)->where('origen_id',1)->first();
        if($respuesta){
            $respuesta->respuesta_text = $atributotext;
            $respuesta->save();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 1 and [origen_id] = 1
update [respuestas] set [respuesta_text] = 'Requerimiento', [respuestas].[updated_at] = '16-04-2021 15:36:49' where [id] = '138393'

    public function guardarespuestapadre($atributoid, string $atributotext, $atributoint){

        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', $atributoid)->where('origen_id',1)->first();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 6 and [origen_id] = 1

        $this->guardarespuesta(93, $this->usuarios3);


        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', 94)->where('origen_id',1)->first();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 94 and [origen_id] = 1

                'origen_id' => 1,
            ]);
        }
        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', 95)->where('origen_id',1)->first();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 95 and [origen_id] = 1

        $pecc = 100;
        $penctotal = 100;
        //Saludo
        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', 6)->first();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 6

            $penc = $penc + 10;
        }
        //Frases
        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', 11)->first();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 11

            $penc = $penc + 10;
        }
        //Cordialidad
        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', 16)->first();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 16

            $penc = $penc + 10;
        }
        //Gestion de Planillas e Info
        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', 21)->first();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 21

            $penc = $penc + 10;
        }
        //Ortografia
        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', 28)->first();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 28

            $penc = $penc + 10;
        }
        //Personalizacion
        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', 32)->first();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 32

            $penc = $penc + 10;
        }
        //Seguridad
        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', 35)->first();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 35

            $penc = $penc + 10;
        }
        //Manejo de Silencios
        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', 39)->first();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 39

            $penc = $penc + 10;
        }
        //Aseguramiento
        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', 42)->first();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 42

            $penc = $penc + 10;
        }
        //Ofrecimiento
        $respuesta = Respuesta::where('evaluacion_id', $this->evaluacionid)->where('atributo_id', 47)->first();
---
select top 1 * from [respuestas] where [evaluacion_id] = 24234 and [atributo_id] = 47

            $pecc = 0;
        }

        $evaluacion = Evaluacion::where('id',$this->evaluacionid)->first();
---
select top 1 * from [evaluacions] where [id] = 24234

        }else{
            $evaluacion->estado_id = 2;
        }
        $evaluacion->updated_at = now();
        $evaluacion->save();
---
update [evaluacions] set [penc] = 80, [pecu] = 100, [pecn] = 100, [pecc] = 100, [user_id] = 1, [created_at] = '16-04-2021 15:36:11', [user_completa] = 'Jose Puebla', [fecha_completa] = '16-04-2021 15:36:11', [user_supervisor] = 'Jose Puebla', [fecha_supervision] = '16-04-2021 15:36:11', [evaluacions].[updated_at] = '16-04-2021 15:36:11' where [id] = '24234'
update [evaluacions] set [penc] = 80, [pecu] = 100, [pecn] = 100, [pecc] = 100, [created_at] = '16-04-2021 16:17:15', [fecha_completa] = '16-04-2021 16:17:15', [fecha_supervision] = '16-04-2021 16:17:15', [evaluacions].[updated_at] = '16-04-2021 16:17:15' where [id] = '24234'