app/Http/Controllers/AsignacionController.php

    public function index($periodoid){

        $periodoidfinal = Periodo::where('periodo_id',$periodoid)->first()->id;
        $periodos = Periodo::all();
        $periodoSeleccionado = Periodo::where('periodo_id',$periodoid)->first()->periodo_id;
        $asignacions = Asignacion::with('agente.servicio', 'evaluacions')->where('periodo_id',$periodoidfinal)
            ->get()
            ->sortByDesc('servicio')
---
select top 1 * from [periodos] where [periodo_id] = '2104'
select * from [periodos]
select * from [agentes] where [agentes].[id] in (24, 25, 26, 27, 28, 29, 30, 32, 33)
select * from [asignacions] where [periodo_id] = 3
select * from [evaluacions] where [evaluacions].[asignacion_id] in (27, 28, 29, 30, 31, 32, 33, 34, 35)
select * from [servicios] where [servicios].[id] in (1, 2)