app/Http/Controllers/EvaluacionController.php

select top 1 * from [evaluacions] where [id] = '24234'
select * from [estados]
---
    public function index($evaluacionid){
        $evaluacionfinal = Evaluacion::where('id',$evaluacionid)->first();
        $estados = Estado::all();